In [1]:
import pandas as pd
import numpy as np

In [4]:
df1 = pd.DataFrame({'A':[1,2,3,4], 'B':[2,3,4, 5], 'C':[3,4, 5, 6]})
df2 = pd.DataFrame({'A':[1,2,3,4], 'B':[2,3,4, 5], 'D':[4, 5, 6, 7]})

In [5]:
df1

   A  B  C
0  1  2  3
1  2  3  4
2  3  4  5
3  4  5  6

In [6]:
df2

   A  B  D
0  1  2  4
1  2  3  5
2  3  4  6
3  4  5  7

In [7]:
df_ = df1.append(df2)
df_

   A  B    C    D
0  1  2  3.0  NaN
1  2  3  4.0  NaN
2  3  4  5.0  NaN
3  4  5  6.0  NaN
0  1  2  NaN  4.0
1  2  3  NaN  5.0
2  3  4  NaN  6.0
3  4  5  NaN  7.0

In [12]:
df_.reset_index().drop('index', axis=1)

   A  B    C    D
0  1  2  3.0  NaN
1  2  3  4.0  NaN
2  3  4  5.0  NaN
3  4  5  6.0  NaN
4  1  2  NaN  4.0
5  2  3  NaN  5.0
6  3  4  NaN  6.0
7  4  5  NaN  7.0

In [13]:
df_.reset_index(drop='True')

   A  B    C    D
0  1  2  3.0  NaN
1  2  3  4.0  NaN
2  3  4  5.0  NaN
3  4  5  6.0  NaN
4  1  2  NaN  4.0
5  2  3  NaN  5.0
6  3  4  NaN  6.0
7  4  5  NaN  7.0

### Joining Dataframes

In [14]:
pd.merge(df1, df2, how='inner', on='A')

   A  B_x  C  B_y  D
0  1    2  3    2  4
1  2    3  4    3  5
2  3    4  5    4  6
3  4    5  6    5  7

In [15]:
pd.merge(df1, df2, how='left', on='A')

   A  B_x  C  B_y  D
0  1    2  3    2  4
1  2    3  4    3  5
2  3    4  5    4  6
3  4    5  6    5  7

In [16]:
pd.merge(df1, df2, how='left', on=['A', 'B'])

   A  B  C  D
0  1  2  3  4
1  2  3  4  5
2  3  4  5  6
3  4  5  6  7

#### Joining by join()

In [31]:
df1.join(df2, lsuffix='_caller', rsuffix='_other', on=['A'])

   A_caller  B_caller  C  A_other  B_other    D
0         1         2  3      2.0      3.0  5.0
1         2         3  4      3.0      4.0  6.0
2         3         4  5      4.0      5.0  7.0
3         4         5  6      NaN      NaN  NaN

In [26]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [27]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [23]:
df_churn=pd.read_excel(r'E:\Fad\data mining\sem2\practices\dataset\Telco - churn.xls')

In [25]:
df_churn.head()

,region,tenure,age,marital,address,income,ed,employ,retire,gender,...,confer,ebill,loglong,logtoll,logequi,logcard,logwire,lninc,custcat,churn
0,2,13,44,1,9,64,4,5,0,0,...,0,0,1.308333,NaN,NaN,2.014903,NaN,4.158883,1,1
1,3,11,33,1,7,136,5,5,0,0,...,1,0,1.481605,3.032546,NaN,2.724580,3.575151,4.912655,4,1
2,3,68,52,1,24,116,1,29,0,1,...,1,0,2.898671,2.890372,NaN,3.409496,NaN,4.753590,3,0
3,2,33,33,0,12,33,2,0,0,1,...,0,0,2.246015,NaN,NaN,NaN,NaN,3.496508,1,1
4,2,23,30,1,9,30,1,2,0,0,...,1,0,1.840550,NaN,NaN,NaN,NaN,3.401197,3,0

### Find average income and maximum age of each education degree (shown in ed field)!

In [35]:
df_g = df_churn.groupby('ed').agg({'income':np.mean, 'age':np.max})
# The keys in dictionary in agg() must be one of the fields of the dataframe
df_g

       income  age
ed
1   60.352941   77
2   68.714286   75
3   86.961722   76
4   89.418803   76
5   97.015152   63

In [36]:
df_g.rename(columns={'income':'income_mean', 'age':'age_max'}, inplace=True)

In [37]:
df_g

    income_mean  age_max
ed
1     60.352941       77
2     68.714286       75
3     86.961722       76
4     89.418803       76
5     97.015152       63

#### groubby on multiple fields and complex index

In [41]:
df_churn.groupby(['ed', 'gender']).agg({'income':np.mean, 'age':np.max, 'ed':np.count_nonzero})

               income  age   ed
ed gender
1  0        51.700935   76  107
   1        69.896907   77   97
2  0        70.328358   72  134
   1        67.300654   75  153
3  0        91.433333   69   90
   1        83.579832   76  119
4  0        77.932773   62  119
   1       101.304348   76  115
5  0        88.515152   63   33
   1       105.515152   61   33

In [43]:
df_g2 = df_churn.groupby(['ed', 'gender']).agg({'age':np.mean, 'income':np.max, 'ed':len})
df_g2

                 age  income   ed
ed gender
1  0       45.514019     345  107
   1       45.649485     361   97
2  0       42.552239    1131  134
   1       41.568627     380  153
3  0       39.844444     928   90
   1       40.773109     732  119
4  0       39.226891     508  119
   1       39.434783    1668  115
5  0       41.787879     333   33
   1       39.515152     944   33

In [45]:
df_g2.index.get_level_values('ed')

Int64Index([1, 1, 2, 2, 3, 3, 4, 4, 5, 5], dtype='int64', name='ed')

In [47]:
df_g2.iloc[(df_g2.index.get_level_values('ed')==3) & (df_g2.index.get_level_values('gender')==1)]

                 age  income   ed
ed gender
3  1       40.773109     732  119

In [53]:
df_churn.groupby(['gender', 'retire']).agg({'age':len}).rename(columns={'age':'count'})

               count
gender retire
0      0         466
       1          17
1      0         487
       1          30

In [54]:
df_churn.groupby(['gender', 'retire']).agg({'age':len}).rename(columns={'age':'count'}).reset_index()

   gender  retire  count
0       0       0    466
1       0       1     17
2       1       0    487
3       1       1     30

### Practice question: Find churn percentage in each region

In [48]:
df_churn.head()

,region,tenure,age,marital,address,income,ed,employ,retire,gender,...,confer,ebill,loglong,logtoll,logequi,logcard,logwire,lninc,custcat,churn
0,2,13,44,1,9,64,4,5,0,0,...,0,0,1.308333,NaN,NaN,2.014903,NaN,4.158883,1,1
1,3,11,33,1,7,136,5,5,0,0,...,1,0,1.481605,3.032546,NaN,2.724580,3.575151,4.912655,4,1
2,3,68,52,1,24,116,1,29,0,1,...,1,0,2.898671,2.890372,NaN,3.409496,NaN,4.753590,3,0
3,2,33,33,0,12,33,2,0,0,1,...,0,0,2.246015,NaN,NaN,NaN,NaN,3.496508,1,1
4,2,23,30,1,9,30,1,2,0,0,...,1,0,1.840550,NaN,NaN,NaN,NaN,3.401197,3,0

In [51]:
df_churn.groupby('region').agg({'churn': np.mean}).rename(columns = {'churn':'average_churn_rate'}).reset_index()

   region  average_churn_rate
0       1            0.279503
1       2            0.281437
2       3            0.261628